Table of Contents
 Enum ProductionType
Namespace
IdeaRS.OpenModel.Material
Assembly
IdeaRS.OpenModel.dll
Production type
public enum ProductionType
Fields
ColdDrawn = 2
Cold drawn
HotRolledAndProcessed = 0
Hot rolled and processed
LowRelaxation = 4
Low relaxation
Patented = 1
Patented
StressRelieved = 3
Stress relieved
Fields
 Name |  Description
 ColdDrawn = 2
Cold drawn
 HotRolledAndProcessed = 0
Hot rolled and processed
 LowRelaxation = 4
Low relaxation
 Patented = 1
Patented
 StressRelieved = 3
Stress relieved
 Edit this page